// # Завдання 7

// Напиши функцію `greet(name)`, яка при викликові буде отримувати імʼя, отримуємо
// імʼя через `prompt`. Якщо імені в масиві немає, через `alert` виводимо
// повідомлення

// - "Вітаємо, бажаєте стати нашим клієнтом?",
// - якщо користувач тисне "ок" додаємо отримане імя в масив, та виводимо в алерт
//   повідомлення, "{імя}, ми раді, що ви з нами".
// - Якщо користувач тисне "Скасувати", виводимо повідомлення, "Шкода, ми всеодно
//   будемо чекати на тебе".
// - Якщо клієнт є в списку, виводимо повідомлення в `alert` '{імя}, ми раді що ви
//   повернулись'

let clients = ['сергій', 'олег', 'віталій', 'анатолій'];

const greet=function(name) {
  if (clients.includes(name)) {
    alert(`${name}, ми раді що ви повернулись`);
  } else {
    const response = confirm("Вітаємо, бажаєте стати нашим клієнтом?");
    if (response) {
      clients.push(name); 
      alert(`${name}, ми раді, що ви з нами`);
    } else {
      alert("Шкода, ми всеодно будемо чекати на тебе");
    }
  }
}

const name = prompt("Введіть своє ім'я:");
greet(name);